In [ ]:
import pandas as pd

In [ ]:
Cab_Data=pd.read_csv("Cab_Data.csv")

In [8]:
City_data = pd.read_csv('City.csv')

In [4]:
Customer_data = pd.read_csv('Customer_ID.csv')

In [5]:
Transaction_data = pd.read_csv('Transaction_ID.csv')

In [ ]:
print(Cab_Data)

In [6]:
Cab_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 16.5+ MB

In [11]:
Cab_Data.describe()

,Transaction ID,Date of Travel,KM Travelled,Price Charged,Cost of Trip
count,3.593920e+05,359392.000000,359392.000000,359392.000000,359392.000000
mean,1.022076e+07,42964.067998,22.567254,423.443311,286.190113
std,1.268058e+05,307.467197,12.233526,274.378911,157.993661
min,1.000001e+07,42371.000000,1.900000,15.600000,19.000000
25%,1.011081e+07,42697.000000,12.000000,206.437500,151.200000
50%,1.022104e+07,42988.000000,22.440000,386.360000,282.480000
75%,1.033094e+07,43232.000000,32.960000,583.660000,413.683200
max,1.044011e+07,43465.000000,48.000000,2048.030000,691.200000

In [13]:
print(City_data)

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [14]:
City_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 312.0+ bytes

In [15]:
City_data.describe()

               City   Population      Users
count            20           20         20
unique           20           20         20
top     NEW YORK NY   8,405,837    302,149
freq              1            1          1

In [17]:
print(Customer_data)

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [18]:
Customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.3+ MB

In [19]:
Customer_data.describe()

        Customer ID           Age  Income (USD/Month)
count  49171.000000  49171.000000        49171.000000
mean   28398.252283     35.363121        15015.631856
std    17714.137333     12.599066         8002.208253
min        1.000000     18.000000         2000.000000
25%    12654.500000     25.000000         8289.500000
50%    27631.000000     33.000000        14656.000000
75%    43284.500000     42.000000        21035.000000
max    60000.000000     65.000000        35000.000000

In [20]:
print(Transaction_data)

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [21]:
Transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 8.4+ MB

In [22]:
Transaction_data.describe

<bound method NDFrame.describe of         Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]>

In [23]:
Cab_Data.duplicated().sum()

0

In [24]:
City_data.duplicated().sum()

0

In [25]:
Customer_data.duplicated().sum()

0

In [26]:
Transaction_data.duplicated().sum()

0

In [31]:
merged_data = pd.merge(Transaction_data, Cab_Data, on ='Transaction ID', how ='left')

In [32]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 440098 entries, 0 to 440097
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
 3   Date of Travel  359392 non-null  float64
 4   Company         359392 non-null  object
 5   City            359392 non-null  object
 6   KM Travelled    359392 non-null  float64
 7   Price Charged   359392 non-null  float64
 8   Cost of Trip    359392 non-null  float64
dtypes: float64(4), int64(2), object(3)
memory usage: 28.5+ MB

In [33]:
new_data=pd.merge(merged_data, Customer_data)

In [34]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 440098 entries, 0 to 440097
Data columns (total 12 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Transaction ID      440098 non-null  int64
 1   Customer ID         440098 non-null  int64
 2   Payment_Mode        440098 non-null  object
 3   Date of Travel      359392 non-null  float64
 4   Company             359392 non-null  object
 5   City                359392 non-null  object
 6   KM Travelled        359392 non-null  float64
 7   Price Charged       359392 non-null  float64
 8   Cost of Trip        359392 non-null  float64
 9   Gender              440098 non-null  object
 10  Age                 440098 non-null  int64
 11  Income (USD/Month)  440098 non-null  int64
dtypes: float64(4), int64(4), object(4)
memory usage: 36.9+ MB

In [35]:
new_data_1=pd.merge(new_data, City_data)

In [36]:
new_data_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 359392 entries, 0 to 359391
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Transaction ID      359392 non-null  int64
 1   Customer ID         359392 non-null  int64
 2   Payment_Mode        359392 non-null  object
 3   Date of Travel      359392 non-null  float64
 4   Company             359392 non-null  object
 5   City                359392 non-null  object
 6   KM Travelled        359392 non-null  float64
 7   Price Charged       359392 non-null  float64
 8   Cost of Trip        359392 non-null  float64
 9   Gender              359392 non-null  object
 10  Age                 359392 non-null  int64
 11  Income (USD/Month)  359392 non-null  int64
 12  Population          359392 non-null  object
 13  Users               359392 non-null  object
dtypes: float64(4), int64(4), object(6)
memory usage: 32.9+ MB

In [40]:
new_data_1["Company"].value_counts()

Yellow Cab    274681
Pink Cab       84711
Name: Company, dtype: int64

In [39]:
#We observe that the number of Yellow Cab is more than 3 times that of Pink Cab.

In [41]:
new_data_1["Age"].value_counts()

23    12327
20    12229
27    12030
25    11973
32    11959
34    11825
39    11798
22    11796
26    11655
19    11591
40    11536
33    11457
21    11431
30    11165
28    11163
24    11151
37    11086
36    11054
31    10930
38    10906
18    10846
29    10675
35    10555
61     4361
45     4248
49     4158
58     4107
50     4089
47     4087
59     4068
42     3970
51     3931
46     3918
64     3908
41     3852
43     3823
54     3810
52     3784
60     3775
56     3742
63     3733
44     3725
48     3700
53     3641
62     3530
57     3473
55     3442
65     3379
Name: Age, dtype: int64

In [ ]:
new_data_1["Gender"].value_counts()

In [ ]:
yellow_cab_prices = new_data_1[new_data_1["Company"] == "Yellow Cab"]["Price Charged"]
print("Price charged by Yellow Cab:")
print(yellow_cab_prices.describe())

pink_cab_prices = new_data_1[new_data_1["Company"] == "Pink Cab"]["Price Charged"]
print("Price charged by Pink Cab:")
print(pink_cab_prices.describe())

In [ ]:
import matplotlib.pyplot as plt

# Calculate mean prices
yellow_cab_mean_price = yellow_cab_prices.mean()
pink_cab_mean_price = pink_cab_prices.mean()

# Create a bar plot
cab_labels = ['Yellow Cab', 'Pink Cab']
mean_prices = [yellow_cab_mean_price, pink_cab_mean_price]

plt.bar(cab_labels, mean_prices)
plt.xlabel('Cab Company')
plt.ylabel('Mean Price Charged')
plt.title('Mean Price Charged by Yellow Cab and Pink Cab')

plt.show()

In [ ]:
# Similarly, we can also compare the cost of Trip between Yellow Cab and Pink Cab

yellow_cab_cost = new_data_1[new_data_1["Company"] == "Yellow Cab"]["Price Charged"]
print("Price charged by Yellow Cab:")
print(yellow_cab_prices.describe())

pink_cab_prices = new_data_1[new_data_1["Company"] == "Pink Cab"]["Price Charged"]
print("Price charged by Pink Cab:")
print(pink_cab_prices.describe())

In [ ]:
1+2